#+options: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline
#+options: author:t broken-links:nil c:nil creator:nil
#+options: d:(not "LOGBOOK") date:t e:t email:nil f:t inline:t num:t
#+options: p:nil pri:nil prop:nil stat:t tags:t tasks:t tex:t
#+options: timestamp:t title:t toc:t todo:t |:t
#+title: Climatic Analysis of Telescope Peak Bristlecone Pine Mortality
#+date: <2022-10-18 Tue>
#+author: Stephen Huysman
#+email: shuysman@gmail.com
#+language: en
#+select_tags: export
#+exclude_tags: noexport
#+creator: Emacs 28.1 (Org mode 9.5.2)
#+BIBLIOGRAPHY:bristlecone.bib
#+cite_export: csl
#+BABEL: :session *R* :cache yes :results output graphics :exports both :tangle yes \n :eval never-export

** Libraries
#+begin_src R :session *R3* :eval never-export
  library(tidyverse)
  library(ggplot2)
  library(readxl)
  library(here)
  library(gghighlight)
  library(ggpubr)
  library(metR)
#+end_src

#+RESULTS:
| metR        |
| ggpubr      |
| gghighlight |
| here        |
| readxl      |
| forcats     |
| stringr     |
| dplyr       |
| purrr       |
| readr       |
| tidyr       |
| tibble      |
| ggplot2     |
| tidyverse   |
| stats       |
| graphics    |
| grDevices   |
| utils       |
| datasets    |
| methods     |
| base        |

*** Libraries and Function Definitions
#+begin_src R :session :eval never-export
  library(raster)
  library(tidyverse)
  library(WaterBalance)
  library(lubridate)
  library(gghighlight)
#+end_src

#+RESULTS:
| lubridate    |
| WaterBalance |
| forcats      |
| stringr      |
| dplyr        |
| purrr        |
| readr        |
| tidyr        |
| tibble       |
| ggplot2      |
| tidyverse    |
| raster       |
| sp           |
| stats        |
| graphics     |
| grDevices    |
| utils        |
| datasets     |
| methods      |
| base         |

Use Penman PET calculation.  Modified from ~WaterBalance::ET_PenmanMonteith_daily~ to work with our data and workflow.  [[https://github.com/CCRP-Adaptation/WaterBalance/blob/6d19806ce5aa6abb6521607fd2da19238dae561d/WaterBalance/R/ET_functions.R#L178][Original version]] had additional arguments for elev and lat, but to facilitate process the df we generate later of all sites we pass lat and elev with each site.

According to David Thoma, ~WaterBalance::ET_PenmanMonteith_daily~ has not been validated against the Simple Water Balance Model xlsm

#+begin_src R :results output silent :session :eval never-export
  ET_PenmanMonteith_daily = function(x, wind=NULL) {
    ##Inputs
    tmax <- x$tmax_C
    tmin <- x$tmin_C
    elev <- x$elev
    lat <- x$lat
    tmean <- (tmax + tmin)/2
    doy <- as.numeric(strftime(x$Date, "%j"))
    rh.max <- x$RHmax
    rh.min <- x$RHmin
    vp <- x$vp
    R.s <- x$srad
    u <- ifelse(is.null(wind) == TRUE, x$wind, wind)
    psyc.const <- psyc_constant(elev)
    vap.curve <- vapor_curve(tmean)
    
    ##Auxilary calculations for wind terms
    DT <- vap.curve/(vap.curve + psyc.const*(1+0.34*u))
    PT <- psyc.const/(vap.curve + (psyc.const*(1+0.34*u)))
    TT <- (900/(tmean + 273))*u

    ##Saturation vapor pressure
    e.tmax <- get_svp(tmax)
    e.tmin <- get_svp(tmin)
    e.s <- (e.tmax + e.tmin)/2

    ##Actual vapor pressure
    if(is.null(vp) == TRUE) {
        if(is.null(rh.max) == TRUE) {
            e.a <- e.tmin
        } else {
            e.a <- actual_vp(rh.max, rh.min)
        }
    } else {
        e.a <- vp
    }

  #Solar angle and radiation calculations
  R.ns <- (1 - 0.23)*R.s
  R.so <- clear_sky_rad(doy, lat, elev)
  R.nl <- outgoing_rad(tmax, tmin, R.s, e.a, R.so)
  R.n <- R.ns - R.nl
  R.ng <- 0.408*R.n

  #ET from radiation
  ET.rad <- DT*R.ng
  #ET from wind
  ET.wind <- PT*TT*(e.s - e.a)
  #Total ET
  ET.o <- ET.rad + ET.wind
  return(ET.o)
}
#+end_src

*** Libraries
#+begin_src R :session *R2* :eval never-export
  library(prism)
  library(plotly)
  library(raster)
  library(ggplot2)
  library(tidyverse)
  library(lubridate)
  library(gghighlight)
#+end_src

#+RESULTS:
| gghighlight |
| lubridate   |
| forcats     |
| stringr     |
| dplyr       |
| purrr       |
| readr       |
| tidyr       |
| tibble      |
| tidyverse   |
| raster      |
| sp          |
| plotly      |
| ggplot2     |
| prism       |
| stats       |
| graphics    |
| grDevices   |
| utils       |
| datasets    |
| methods     |
| base        |

Be sure to set the download folder using ~prism_set_dl_dir()~.
#+begin_src R :session *R2* :results output none :eval never-export
  prism_set_dl_dir("~/prismtmp")
#+end_src
